blogs/why-service-latency-becomes-high-when-the-load-is-not-high.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-29 日 21:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>k8s环境增加实例，其它实例延迟变高（1）</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">k8s环境增加实例，其它实例延迟变高（1）</h1>
<p>
k8s环境通常会在一台物理机上部署各种服务，各服务通过cgroup限制自身CPU、内存的使用，保障隔离性。
在线上发现一台机器，一旦启动其它实例，原有实例的延迟就会升高。
此时整机的CPU使用率不足30%，IO也很少，传统视角看，整机的负载非常低。
</p>

<div id="outline-container-org4554bc0" class="outline-2">
<h2 id="org4554bc0"><span class="section-number-2">1</span> 实例部署现状</h2>
<div class="outline-text-2" id="text-1">
<p>
这台机器有2个socket，每个socket 26个core，开启了超线程，整机看有104个CPU。
我们把延迟升高的那个实例称作A。
</p>

<ol class="org-ol">
<li>socket0的CPU使用率在32%左右，socket1在15%左右，两个socket的CPU使用率非常不均衡;</li>
<li>实例A做了numa亲和，运行在socket0，CPU使用率在30%左右（1500%-1700% 按照52个CPU折算）。</li>
</ol>
</div>
</div>

<div id="outline-container-org3ab0536" class="outline-2">
<h2 id="org3ab0536"><span class="section-number-2">2</span> 实例A受影响的情况</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>实例A的IPC之前稳定在0.75左右，新增实例后在0.5-0.6间波动;</li>
<li>实例A的CPU使用率之前稳定在1200，新增实例后在1300-1800%间波动;</li>
</ol>

<p>
实例A CPU使用率的变化解释了实例A延迟的上升，也表明受到了新增实例的干扰。
但是从整机层面看，新增加实例后，CPU使用率上升不到1%，变化非常小，所以实例A受到的干扰，应该不是来自CPU的争用。
</p>
</div>
</div>

<div id="outline-container-org4e19330" class="outline-2">
<h2 id="org4e19330"><span class="section-number-2">3</span> 内存带宽</h2>
<div class="outline-text-2" id="text-3">
<p>
在讨论机器负载时，内存带宽通常是一个被忽略的因素。当内存带宽超过某个值（通常在50%左右），内存延迟会急剧上升，则IPC下降，CPU使用率升高。
</p>

<p>
内存带宽的变化：
</p>
<ol class="org-ol">
<li>socket0的单通道带宽从7G上升到12G;</li>
<li>socket1的单通道带宽几乎没有变化，在4G左右。</li>
</ol>

<p>
socket0的单通道带宽12G，差不多50%左右，应该是它导致了实例A延迟的上升。
</p>

<p>
前面提到socket1 CPU使用率低，新增加的实例，如果没有numa亲和，内核通常会调度到socket1运行，保证两个socket CPU使用的均衡，理论上socket1的带宽应该上升才对。
</p>
</div>
</div>

<div id="outline-container-org32190f8" class="outline-2">
<h2 id="org32190f8"><span class="section-number-2">4</span> 内存分配的均衡</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>numactl -H</code> 观察两个socket的内存情况，socket1的free内存极少，socket0则较多。
一个合理的猜测是，因为socket0的free内存较多，新增实例的内存分配总是发生在socket0,无论新增实例运行在socket0,还是socket1,内存带宽的消耗总是发生在socket0。（内核可能为了避免跨socket访问内存，而牺牲掉CPU使用的均衡）
</p>

<p>
因为使用的内存中pagecache很多，通过 <code>echo 3 | tee /proc/sys/vm/drop_caches</code> 释放pagecache，增加socket1的free内存，可用避免跨socket分配内存。
</p>

<p>
这个操作后的变化：
</p>
<ol class="org-ol">
<li>socket0的单通道带宽恢复到7G，socket1的单通道带宽上升到6G;</li>
<li>实例A的CPU使用率恢复到1200%，业务延迟恢复;</li>
<li>两个socket的cpu使用率变得均衡。</li>
</ol>

<p>
<b>疑惑</b> socket0的单通道带宽下降5G，而socket1的单通道带宽只上升2G，这两个值有点对不上。
</p>

<p>
如何保证socket的内存均衡呢？一个可行的方法是，机器的所有组件都放到cgroup中，限制每个cgroup的内存，这样可以保证pagecache的隔离。
</p>
</div>
</div>

<div id="outline-container-org72f00bb" class="outline-2">
<h2 id="org72f00bb"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<p>
因为pagecache导致socket间free内存不均衡，出现了跨socket分配（使用）内存的情况，导致socket间内存带宽不均衡，其中一个socket内存带宽饱和，影响了业务可用性。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-10-29 日 21:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
